# Insert Function

In [3]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
var.insert(1,"Python",var["A"])
var

   A  Python  B
0  1       1  4
1  2       2  5
2  3       3  6

In [5]:
var.insert(1,"Python1",[11,12,13])
var

   A  Python1  Python  B
0  1       11       1  4
1  2       12       2  5
2  3       13       3  6

In [6]:
var["Python2"] = var["A"][:2]
var

   A  Python1  Python  B  Python2
0  1       11       1  4      1.0
1  2       12       2  5      2.0
2  3       13       3  6      NaN

# Delete Function

In [11]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3],"B":[4,5,6],"C":[7,8,9]})
var1 = var.pop("B")
var

   A  C
0  1  7
1  2  8
2  3  9

In [14]:
del var["A"]
var

   C
0  7
1  8
2  9